tempDirs/tmp9x81en8u/system/meshDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "system";
 object meshDict;
}

surfaceFile "betterFullGeometry.stl";

maxCellSize 0.05015394699339536; 	//maxCellSize	0.03545;//nCellsBetweenLevels	1;//nAdditionalLayersOfRefinementNearBoundary 1;

enforceGeometryConstraints 0; 	//decomposePolyhedraIntoTetsAndPyrs 1;

boundaryCellSize 0.08; 	//boundaryCellSizeRefinementThickness	0.1;

edgeMeshRefinement
{
} 	//    edge1//    {//	edgeFile "fe_10_degrees_featureEdges.vtk";////	edgeFile "feature_edges_featureEdges.vtk";//	//cellSize 0.0017725;//	additionalRefinementLevels 3;//	refinementThickness 0.0017725;//    }////    bottom_ring_edge//    {//	    edgeFile "surfaceMeshes/bottom_ring_featureEdges.vtk";//	    additionalRefinementLevels	4;//	    refinementThickness	8.8625e-4;//	    //    }

domainDefinition
{
  convertAllPatchesToFaceZones 1;
  detachPointsAtAllInternalPatches 0;
  generateMeshInAllDomains 1;
}

surfaceMeshRefinement
{
} 	//	base_and_inlets//	{//		surfaceFile	"surfaceMeshes/base_and_inlets_scaled.stl";//		cellSize	0.003545;//		//additionalRefinementLevels 1;//		//refinementThickness	0.001;//	}//	ribs//	{//		surfaceFile	"surfaceMeshes/ribs_scaled.stl";//		//cellSize	0.0017725;//		additionalRefinementLevels 3;//		refinementThickness	0.0017725;//	}//	inner_stack//	{//		surfaceFile	"surfaceMeshes/inner_stack_scaled.stl";//		cellSize	0.003545;//	}//	inlet_hoods//	{//		surfaceFile	"surfaceMeshes/inlet_hoods_scaled.stl";//		cellSize	0.0017725;//	}//	plate_edges//	{//		surfaceFile	"surfaceMeshes/plate_edges_scaled.stl";//		//cellSize	0.0017725;//		additionalRefinementLevels	3;//		refinementThickness	0.0017725;//	}

localRefinement
{
} 	// 	trap_surface//	{//		//additionalRefinementLevels 1;//		cellSize 0.00709;//	}////	refinement_walls//	{//		//		//additionalRefinementLevels 1;//		cellSize 0.00709;//	}//	non_refinement_walls//	{//		//additionalRefinementLevels 1;//		cellSize 0.00709;//	}//	free_surface//	{//		additionalRefinementLevels 2;//		//cellSize 0.01;//	}

boundaryLayers
{
} 	/*
  nLayers 4;
  thicknessRatio 1.5;
  firstLayerThickness 0.018;
  patchBoundaryLayers
  {
    outletWater
    {
      nLayers 0;
    }
    inletWater
    {
      nLayers 0;
    }

  }
*///    patchBoundaryLayers//    {//        trap_surface//        {//            nLayers           5;////	    nOuterLayers	2;//	    outerThicknessRatio	1.5;//            thicknessRatio    1.15;////            firstLayerThickness 1e-3;//	    allowDiscontinuity	0;//	    //trying to set yplus////	    //L	1.0;//	    //U	1.0;//	    //mu	0.001;//	    //rho	997.0;//	    //desiredYPlus	50.0;//	    //nLayers	5;//	    //thicknessRatio	1.15;////////        }////    	non_refinement_walls//        {//            nLayers           5;////            nOuterLayers        2;//            outerThicknessRatio 1.5;//            thicknessRatio    1.15;////            firstLayerThickness 1e-3;//            allowDiscontinuity	0;////	    //L   1.0;//            //U   1.0;//            //mu  0.001;//            //rho 997.0;//            //desiredYPlus        50.0;//            //nLayers     5;//            //thicknessRatio      1.15;////////        }////	refinement_walls//	{//            nLayers           5;////            nOuterLayers        2;//            outerThicknessRatio 1.5;//            thicknessRatio    1.15;////            firstLayerThickness 1e-3;////	    allowDiscontinuity	0;////            //L   1.0;//            //U   1.0;//            //mu  0.001;//            //rho 997.0;//            //desiredYPlus        50.0;//            //nLayers     5;//            //thicknessRatio      1.15;//////	}////    }

renameBoundary
{
  defaultName fixedWalls;
  defaultType wall;
  newPatchNames
  {
    inletWater
    {
      newName inletWater;
      type patch;
    }
    outletWater
    {
      newName outletWater;
      type patch;
    }
    freeSurface
    {
      newName freeSurface;
      type patch;
    }
    leftSide
    {
      newName leftSide;
      type wall;
    }
    rightSide
    {
      newName rightSide;
      type wall;
    }
    bedWall
    {
      newName bedWall;
      type wall;
    }
  }
}

meshQualitySettings
{
  maxNonOrthogonality 82;
  maxSkewness 4; 	//maxInternalSkewness 4;//minTetQuality 0.8;//minDeterminant 0.001;//	minFaceTriangleTwist 1;//	minFaceTwist	1;
  surfaceMapping
  {
    maxNumIterations 1000;
    minRelDisp 0.001;
  }
  surfacePremapping
  {
    maxNumIterations 1000;
    minRelDisp 0.001;
  }
  surfaceOptimization
  {
    maxNumIterations 100;
    minRelDisp 0.001;
  }
  volumeOptimization
  {
    maxNumIterations 15;
    minRelDisp 0.001;
  }
}

workflowControls
{
} 	//stopAfter edgeExtraction;//restartFromLatestStep	1;// ************************************************************************* //

