tempDirs/tmp9x81en8u/constant/turbulenceProperties
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "constant";
 object turbulenceProperties;
}

simulationType RAS;

RAS
{
  RASModel kEpsilon;
  turbulence yes;
  printCoeffs yes;
  sigmaEps 1.226491226327883;
} 	// ************************************************************************* //

