tempDirs/tmp9x81en8u/0/Conc045
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volScalarField;
 location "0";
 object Conc;
}

dimensions [ 0 0 0 0 0 0 0 ];

internalField uniform 0;

boundaryField
{
  bedWall
  {
    type zeroGradient;
  }
  leftSide
  {
    type zeroGradient;
  }
  rightSide
  {
    type zeroGradient;
  }
  freeSurface
  {
    type zeroGradient;
  }
  inletWater
  {
    type fixedValue;
    value uniform 0.0003938364251489925;
  }
  outletWater
  {
    type zeroGradient;
  }
  defaultFaces
  {
    type empty;
  }
} 	// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

