tempDirs/tmp9x81en8u/0/S_explicit02
FoamFile 
{
    version      2.0;
    format       ascii;
    class        volScalarField;
    location     "0";
    object       S_explicit;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    bedWall
    {
        type            zeroGradient;
     }
    leftSide
    {
        type            zeroGradient;
     }
    rightSide
    {
        type            zeroGradient;
     }
    freeSurface
    {
        type            zeroGradient;
    }
    inletWater
    {
        type            zeroGradient;
    }
    outletWater
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


