tempDirs/tmp9x81en8u/0/nut
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volScalarField;
 location "0";
 object nut;
}

dimensions [ 0 2 -1 0 0 0 0 ];

internalField uniform 0;

boundaryField
{
  bedWall
  {
    type nutURoughWallFunction;
    value uniform 0;
    Ks uniform 0.0;
    Cs uniform 0.5;
    roughnessHeight 0.0;
    roughnessConstant 0.5;
    roughnessFactor 1;
  }
  leftSide
  {
    type nutkWallFunction;
    value uniform 0;
  }
  rightSide
  {
    type nutkWallFunction;
    value uniform 0;
  }
  freeSurface
  {
    type zeroGradient;
  }
  inletWater
  {
    type calculated;
    value uniform 0.01;
  }
  outletWater
  {
    type zeroGradient;
  }
  defaultFaces
  {
    type empty;
  }
} 	// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

